* LaTEX Practice
** Dependencies
1. linux package aspell-en
2. emacs packages: flyspell, cdlatex, auctex, texlive?
3. Make sure that preamble.tex is (setq org-src-fontify-natively t)in the same fo(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))lder as the org document

** Q1. Let's try some stuff out
  + To see latex snippets use ctrl-( c x l). cancel with ctrl-(c c)
  + How about some fractions? 
\[\frac{1}{2} + 7 = 7.5\]
  +  Let's try the continuity equation
\[\frac{\partial \rho}{\partial t} + \nabla \cdot \left(\frac{1}{2}\rho u\right)\]

Pure Latex seems to work as well:
\begin{equation}
\frac{1}{2} + 6x + x^{2}
\end{equation}

cdlatex mode allows for auto-completion:
1. using fr <tab> creates fraction template
2. using ^ raises to a power. $x^{2}$
3. equ <tab> creates numbered equation template
4. tilda key opens menu of shortcuts, so tilda d creates $\delta$. Tilda-tilda d creates $\partial$.

** Workflow
- words in org mode
- math in latex with cdlatex
- export as pdf with M-x org-latex-export-to-pdf RET
** ToDo list: [0/4]
- [ ] Learn how to insert figures with descriptions
- [ ] learn how to use bibliography
- [ ] learn how to insert code snippets
- [ ] Learn how to create figure list,

** Q2. Let's try out some code snippets:
- Code snippet created with <s <TAB>
- evaluate code snippet with 
#+BEGIN_SRC python :session:
testlist = []
for i in range(10):
    if i > 5:
        testlist.append(i)
return(testlist)

#+END_SRC

#+RESULTS:
| 6 | 7 | 8 | 9 |

* Org and Latex config :noexport:
#+title: Homework Sample Template
#+AUTHOR: Michael Laufer testing
# Don't make a title page
#+OPTIONS: toc:nil
#+BIND: org-export-latex-t
#+latex_header: \input {preamble.tex}


